# Introduction to Pandas

## Overview

This module introduces Pandas, a powerful data manipulation library for Python. It covers basic operations, data structures, and common data analysis tasks using Pandas, including analyzing, cleaning, exploring, and manipulating data.

## Learning Objectives

- Understand Pandas data structures: Series and DataFrame
- Learn to create, read, and manipulate DataFrames
- Perform basic data analysis operations using Pandas
- Handle missing data in Pandas

## Prerequisites

- Basic Python knowledge (For a refresher, see the [Python tutorial](https://docs.python.org/tutorial/).)
- Familiarity with NumPy is helpful but not required

## Get Started

Install pandas and import the required libraries.

In [1]:
# Install the tables library to read and write HDF5 files, typically used for large datasets
%pip install tables

# Install the openpyxl library to read and write Excel files (.xlsx)
%pip install openpyxl

# Import pandas library, used for data manipulation and analysis
import pandas as pd

# Import numpy library, used for numerical operations and working with arrays
import numpy as np

Requirement already satisfied: tables in /Users/chenc/miniconda3/lib/python3.9/site-packages (3.9.2)
Requirement already satisfied: numpy>=1.19.0 in /Users/chenc/miniconda3/lib/python3.9/site-packages (from tables) (1.26.4)
Requirement already satisfied: numexpr>=2.6.2 in /Users/chenc/miniconda3/lib/python3.9/site-packages (from tables) (2.10.2)
Requirement already satisfied: packaging in /Users/chenc/miniconda3/lib/python3.9/site-packages (from tables) (23.1)
Requirement already satisfied: py-cpuinfo in /Users/chenc/miniconda3/lib/python3.9/site-packages (from tables) (9.0.0)
Requirement already satisfied: blosc2>=2.3.0 in /Users/chenc/miniconda3/lib/python3.9/site-packages (from tables) (2.5.1)
Requirement already satisfied: ndindex>=1.4 in /Users/chenc/miniconda3/lib/python3.9/site-packages (from blosc2>=2.3.0->tables) (1.9.2)
Requirement already satisfied: msgpack in /Users/chenc/miniconda3/lib/python3.9/site-packages (from blosc2>=2.3.0->tables) (1.1.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: openpyxl in /Users/chenc/miniconda3/lib/python3.9/site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in /Users/chenc/miniconda3/lib/python3.9/site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

## Object creation

See the [introduction to data structures](https://pandas.pydata.org/docs/user_guide/dsintro.html#dsintro) section of Pandas documentation for details.

You can create a [Series](https://pandas.pydata.org/docs/reference/api/pandas.Series.html#pandas.Series) (One-dimensional ndarray with axis labels, including time series) by passing a list of values, letting pandas create a default integer index:

In [2]:
# Create a pandas Series with some integer values and a NaN (Not a Number) value
# The NaN value represents missing data or undefined values in the series
s = pd.Series([1, 3, 5, np.nan, 6, 8])

# Display the Series to view its contents
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
# Create a pandas Series with hourly energy consumption values (in kWh) for a day
# The index represents hours (0 to 23), and the values are sample energy readings
energy = pd.Series(
    [2.5, 2.7, 2.3, 2.1, 2.0, 2.4, 2.8, 3.0, 3.5, 3.2, 3.1, 2.9, 2.8, 2.6, 2.5, 2.7, 3.0, 3.4, 3.6, 3.2, 2.9, 2.5, 2.3, 2.1],
    index=range(24)
)

In [4]:
# Display the entire Series to view its contents
print("Full Series:")
print(energy)

Full Series:
0     2.5
1     2.7
2     2.3
3     2.1
4     2.0
5     2.4
6     2.8
7     3.0
8     3.5
9     3.2
10    3.1
11    2.9
12    2.8
13    2.6
14    2.5
15    2.7
16    3.0
17    3.4
18    3.6
19    3.2
20    2.9
21    2.5
22    2.3
23    2.1
dtype: float64

In [5]:
# Slice the `energy` Series to extract elements from index 2 to 15 (exclusive) with a step of 3
# This means selecting every third element starting from index 2 up to (but not including) index 15
# Corresponds to hours 2, 5, 8, 11, 14
print("\nSlice from index 2 to 15 with step 3:")
print(energy[2:15:3])

Slice from index 2 to 15 with step 3:
2     2.3
5     2.4
8     3.5
11    2.9
14    2.5
dtype: float64

You can create a [DataFrame](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html#pandas.DataFrame) (Two-dimensional, size-mutable, potentially heterogeneous tabular data) by passing a NumPy array, with a datetime index and labeled columns:

In [6]:
# Generates a range of equally spaced time points (dates)
# "20220306" is the starting date (March 6, 2022)
# `periods=6` specifies that the range will contain 6 equally spaced dates
dates = pd.date_range("20220306", periods=6)

# Displays the generated date range
dates

DatetimeIndex(['2022-03-06', '2022-03-07', '2022-03-08', '2022-03-09',
               '2022-03-10', '2022-03-11'],
              dtype='datetime64[ns]', freq='D')

In [7]:
# Create a DataFrame with random values from a standard normal distribution
# The shape of the DataFrame is (6, 4), i.e., 6 rows and 4 columns
# The index is set to the `dates` variable (which should be a list, array, or pandas DateTimeIndex)
# The column labels are set to the list ['A', 'B', 'C', 'D']
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

# Display the DataFrame
df

                   A         B         C         D
2022-03-06 -0.670684  0.271868  0.824433 -0.209901
2022-03-07 -0.741747 -0.846171 -0.606836 -0.427040
2022-03-08  2.444058 -1.958974  0.472534  0.711935
2022-03-09 -0.958433 -0.159032 -1.932648 -0.071142
2022-03-10 -0.206521  0.508824  0.094088 -1.158213
2022-03-11 -0.751636 -0.548407  0.892564 -2.556644

You can also create a DataFrame by passing a dictionary of objects that can be converted into a series-like structure:

In [8]:
# Create a new DataFrame named df2 with various types of data for each column
df2 = pd.DataFrame(
    {
        # Column 'A' with a constant value of 1.0 for all rows
        "A": 1.0,
        # Column 'B' with a single timestamp (2013-01-02) for all rows
        "B": pd.Timestamp("20130102"),
        # Column 'C' with a pandas Series of length 4 filled with 1's, dtype is float32
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        # Column 'D' with a NumPy array of integers (3 repeated 4 times), dtype is int32
        "D": np.array([3] * 4, dtype="int32"),
        # Column 'E' with a categorical variable containing 'test' and 'train'
        "E": pd.Categorical(["test", "train", "test", "train"]),
        # Column 'F' with a string constant "foo" for all rows
        "F": "foo",
    }
)

# Display the DataFrame df2
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

The columns of the resulting DataFrame have different `dtypes`:

In [9]:
# Display the data types of each column in the DataFrame `df2`
# This allows us to check the type of data stored in each column (e.g., int, float, object, etc.)
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

## Viewing data

See [Essential basic functionality](https://pandas.pydata.org/docs/user_guide/basics.html#basics) section of Pandas documentation for details.

You can view the top and bottom rows of the frame:

In [10]:
df.head(3)  # first three rows

                   A         B         C         D
2022-03-06 -0.670684  0.271868  0.824433 -0.209901
2022-03-07 -0.741747 -0.846171 -0.606836 -0.427040
2022-03-08  2.444058 -1.958974  0.472534  0.711935

In [11]:
df.tail(2)  # last two rows

                   A         B         C         D
2022-03-10 -0.206521  0.508824  0.094088 -1.158213
2022-03-11 -0.751636 -0.548407  0.892564 -2.556644

You can display the indexes and columns:

In [12]:
df.index

DatetimeIndex(['2022-03-06', '2022-03-07', '2022-03-08', '2022-03-09',
               '2022-03-10', '2022-03-11'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

**describe**() shows a quick statistic summary of your data:
#### **What It Calculates**  

##### **For Numeric Columns**  
| Statistic | Meaning | Example |  
|-----------|---------|---------|  
| **count** | Number of non-missing values | `100` (out of 100 rows) |  
| **mean**  | Average value | `25.3` |  
| **std**   | Standard deviation (spread of data) | `10.5` |  
| **min**   | Smallest value | `5` |  
| **25%**   | 25th percentile (Q1) | `18` |  
| **50%**   | Median (Q2) | `25` |  
| **75%**   | 75th percentile (Q3) | `32` |  
| **max**   | Largest value | `50` |  

##### **For Categorical Columns** (e.g., strings)  
| Statistic | Meaning | Example |  
|-----------|---------|---------|  
| **count** | Non-missing values | `150` |  
| **unique**| Number of distinct categories | `5` |  
| **top**   | Most frequent category | `"IT"` |  
| **freq**  | Count of the top category | `42` |

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.147494 -0.455315 -0.042644 -0.618501
std    1.293762  0.890906  1.077123  1.124363
min   -0.958433 -1.958974 -1.932648 -2.556644
25%   -0.749164 -0.771730 -0.431605 -0.975419
50%   -0.706216 -0.353719  0.283311 -0.318470
75%   -0.322562  0.164143  0.736458 -0.105832
max    2.444058  0.508824  0.892564  0.711935

Transposing your data:

In [15]:
df.T

   2022-03-06  2022-03-07  2022-03-08  2022-03-09  2022-03-10  2022-03-11
A   -0.670684   -0.741747    2.444058   -0.958433   -0.206521   -0.751636
B    0.271868   -0.846171   -1.958974   -0.159032    0.508824   -0.548407
C    0.824433   -0.606836    0.472534   -1.932648    0.094088    0.892564
D   -0.209901   -0.427040    0.711935   -0.071142   -1.158213   -2.556644

[Sorting](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_index.html) by axis:

In [16]:
# The axis along which to sort. The value 0 identifies the rows, and 1 identifies the columns.
df.sort_index(axis=1, ascending=False)  # Sort based on column label

                   D         C         B         A
2022-03-06 -0.209901  0.824433  0.271868 -0.670684
2022-03-07 -0.427040 -0.606836 -0.846171 -0.741747
2022-03-08  0.711935  0.472534 -1.958974  2.444058
2022-03-09 -0.071142 -1.932648 -0.159032 -0.958433
2022-03-10 -1.158213  0.094088  0.508824 -0.206521
2022-03-11 -2.556644  0.892564 -0.548407 -0.751636

[Sorting](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html#pandas.DataFrame.sort_values) by values:

In [17]:
df.sort_values(by="C")  # Sort by 'C' column ascending

                   A         B         C         D
2022-03-09 -0.958433 -0.159032 -1.932648 -0.071142
2022-03-07 -0.741747 -0.846171 -0.606836 -0.427040
2022-03-10 -0.206521  0.508824  0.094088 -1.158213
2022-03-08  2.444058 -1.958974  0.472534  0.711935
2022-03-06 -0.670684  0.271868  0.824433 -0.209901
2022-03-11 -0.751636 -0.548407  0.892564 -2.556644

## Selection

See [Indexing and Selecting Data](https://pandas.pydata.org/docs/user_guide/indexing.html#indexing) section of Pandas documentation for details.

Selecting a single column, which yields a Series, equivalent to df.A:

In [18]:
df["A"]  # Select 'A' column

2022-03-06   -0.670684
2022-03-07   -0.741747
2022-03-08    2.444058
2022-03-09   -0.958433
2022-03-10   -0.206521
2022-03-11   -0.751636
Freq: D, Name: A, dtype: float64

Selecting via [], which slices the rows:

In [19]:
df[0:4]  # Select first 4 rows

                   A         B         C         D
2022-03-06 -0.670684  0.271868  0.824433 -0.209901
2022-03-07 -0.741747 -0.846171 -0.606836 -0.427040
2022-03-08  2.444058 -1.958974  0.472534  0.711935
2022-03-09 -0.958433 -0.159032 -1.932648 -0.071142

In [20]:
df["20220306":"20220310"]  # Get "2022-03-06" through "2022-03-10" rows

                   A         B         C         D
2022-03-06 -0.670684  0.271868  0.824433 -0.209901
2022-03-07 -0.741747 -0.846171 -0.606836 -0.427040
2022-03-08  2.444058 -1.958974  0.472534  0.711935
2022-03-09 -0.958433 -0.159032 -1.932648 -0.071142
2022-03-10 -0.206521  0.508824  0.094088 -1.158213

### Selection by label

- **loc** selects rows and columns with specific labels.
- **at** selects a single value for a row/column pair with specific labels (faster than `loc` when you only need a single value)

Getting a cross section using a label:

In [21]:
dates

DatetimeIndex(['2022-03-06', '2022-03-07', '2022-03-08', '2022-03-09',
               '2022-03-10', '2022-03-11'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df.loc[dates[0]]  # Get row indexed by '2022-03-06'

A   -0.670684
B    0.271868
C    0.824433
D   -0.209901
Name: 2022-03-06 00:00:00, dtype: float64

Selecting on a multi-axis by label:

In [23]:
df.loc[:, ["A", "B"]]  # Get 'A' and 'B' columns for all rows

                   A         B
2022-03-06 -0.670684  0.271868
2022-03-07 -0.741747 -0.846171
2022-03-08  2.444058 -1.958974
2022-03-09 -0.958433 -0.159032
2022-03-10 -0.206521  0.508824
2022-03-11 -0.751636 -0.548407

Showing label slicing, both endpoints are included:

In [24]:
df.loc[
    "20220307":"20220309", ["A", "B"]
]  # # Get 'A' and 'B' columns for rows indexed by '2022-03-07' through '2022-03-09'

                   A         B
2022-03-07 -0.741747 -0.846171
2022-03-08  2.444058 -1.958974
2022-03-09 -0.958433 -0.159032

Reduction in the dimensions of the returned object:

In [25]:
df.loc["20220308", ["A", "B"]]  # Get 'A' and 'B' columns of '2022-03-08' row

A    2.444058
B   -1.958974
Name: 2022-03-08 00:00:00, dtype: float64

Getting a scalar value:

In [26]:
df.loc[dates[0], "A"]  # Get value at dates[0] row and 'A' column.

-0.6706836168720861

Getting fast access to a scalar (equivalent to the prior method):

In [27]:
df.at[dates[0], "A"]

-0.6706836168720861

### Selection by position

- **iloc** selects rows and columns at specific integer positions.
- **iat** selects a single value for a row/column pair at specific integer positions (faster than `iloc` when you only need a single value)

Selecting via the position of the passed integers:

In [28]:
df.iloc[2]  # Get all values of third row

A    2.444058
B   -1.958974
C    0.472534
D    0.711935
Name: 2022-03-08 00:00:00, dtype: float64

By integer slices, similar to NumPy/Python:

In [29]:
df

                   A         B         C         D
2022-03-06 -0.670684  0.271868  0.824433 -0.209901
2022-03-07 -0.741747 -0.846171 -0.606836 -0.427040
2022-03-08  2.444058 -1.958974  0.472534  0.711935
2022-03-09 -0.958433 -0.159032 -1.932648 -0.071142
2022-03-10 -0.206521  0.508824  0.094088 -1.158213
2022-03-11 -0.751636 -0.548407  0.892564 -2.556644

In [30]:
df.iloc[3:5, 0:2]  # Get values of 4 and 5 rows, 'A', 'B' columns

                   A         B
2022-03-09 -0.958433 -0.159032
2022-03-10 -0.206521  0.508824

By lists of integer position locations, similar to the NumPy/Python style:

In [31]:
df.iloc[[1, 2, 4], [0, 2]]  # Get values of 2, 3, 5 rows, 'A', 'C' columns

                   A         C
2022-03-07 -0.741747 -0.606836
2022-03-08  2.444058  0.472534
2022-03-10 -0.206521  0.094088

Slicing rows explicitly:

In [32]:
df.iloc[1:3, :]  # Get values of 2 and 3 rows

                   A         B         C         D
2022-03-07 -0.741747 -0.846171 -0.606836 -0.427040
2022-03-08  2.444058 -1.958974  0.472534  0.711935

Slicing columns explicitly:

In [33]:
df.iloc[:, 1:3]  # Get values of 2 and 3 columns

                   B         C
2022-03-06  0.271868  0.824433
2022-03-07 -0.846171 -0.606836
2022-03-08 -1.958974  0.472534
2022-03-09 -0.159032 -1.932648
2022-03-10  0.508824  0.094088
2022-03-11 -0.548407  0.892564

Getting a value explicitly:

In [34]:
df.iloc[1, 1]  # Get value at 2nd row and 2nd columns

-0.8461708398077648

Getting fast access to a scalar (equivalent to the prior method):

In [35]:
df.iat[1, 1]

-0.8461708398077648

### Boolean indexing

Using a single column’s values to select data:

In [36]:
df[df["A"] > 0]  # Get rows where 'A' columns is greater than 0

                   A         B         C         D
2022-03-08  2.444058 -1.958974  0.472534  0.711935

Using the isin() method for filtering:

In [37]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]  # Add new column 'E'
df2

                   A         B         C         D      E
2022-03-06 -0.670684  0.271868  0.824433 -0.209901    one
2022-03-07 -0.741747 -0.846171 -0.606836 -0.427040    one
2022-03-08  2.444058 -1.958974  0.472534  0.711935    two
2022-03-09 -0.958433 -0.159032 -1.932648 -0.071142  three
2022-03-10 -0.206521  0.508824  0.094088 -1.158213   four
2022-03-11 -0.751636 -0.548407  0.892564 -2.556644  three

In [38]:
df2[
    df2["E"].isin(["two", "four"])
]  # Get rows where the values in column 'E' is either "two" or "four"

                   A         B         C         D     E
2022-03-08  2.444058 -1.958974  0.472534  0.711935   two
2022-03-10 -0.206521  0.508824  0.094088 -1.158213  four

## Setting

Setting a new column automatically aligns the data by the indexes:

In [39]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20220306", periods=6))
s1

2022-03-06    1
2022-03-07    2
2022-03-08    3
2022-03-09    4
2022-03-10    5
2022-03-11    6
Freq: D, dtype: int64

In [40]:
df["F"] = s1
df

                   A         B         C         D  F
2022-03-06 -0.670684  0.271868  0.824433 -0.209901  1
2022-03-07 -0.741747 -0.846171 -0.606836 -0.427040  2
2022-03-08  2.444058 -1.958974  0.472534  0.711935  3
2022-03-09 -0.958433 -0.159032 -1.932648 -0.071142  4
2022-03-10 -0.206521  0.508824  0.094088 -1.158213  5
2022-03-11 -0.751636 -0.548407  0.892564 -2.556644  6

Setting values by label:

In [41]:
df.at[dates[0], "A"] = 0  # Set the value at dates[0] and 'A' column to be 0
df

                   A         B         C         D  F
2022-03-06  0.000000  0.271868  0.824433 -0.209901  1
2022-03-07 -0.741747 -0.846171 -0.606836 -0.427040  2
2022-03-08  2.444058 -1.958974  0.472534  0.711935  3
2022-03-09 -0.958433 -0.159032 -1.932648 -0.071142  4
2022-03-10 -0.206521  0.508824  0.094088 -1.158213  5
2022-03-11 -0.751636 -0.548407  0.892564 -2.556644  6

Setting values by position:

In [42]:
df.iat[0, 1] = 0  # Set the value at first row, second column to be 0
df

                   A         B         C         D  F
2022-03-06  0.000000  0.000000  0.824433 -0.209901  1
2022-03-07 -0.741747 -0.846171 -0.606836 -0.427040  2
2022-03-08  2.444058 -1.958974  0.472534  0.711935  3
2022-03-09 -0.958433 -0.159032 -1.932648 -0.071142  4
2022-03-10 -0.206521  0.508824  0.094088 -1.158213  5
2022-03-11 -0.751636 -0.548407  0.892564 -2.556644  6

Setting by assigning with a NumPy array:

In [43]:
df[df.columns[3]] = np.array([5] * len(df)) # Index-Based Assignment
df

                   A         B         C  D  F
2022-03-06  0.000000  0.000000  0.824433  5  1
2022-03-07 -0.741747 -0.846171 -0.606836  5  2
2022-03-08  2.444058 -1.958974  0.472534  5  3
2022-03-09 -0.958433 -0.159032 -1.932648  5  4
2022-03-10 -0.206521  0.508824  0.094088  5  5
2022-03-11 -0.751636 -0.548407  0.892564  5  6

## Missing data

See [Missing Data](https://pandas.pydata.org/docs/user_guide/missing_data.html#missing-data) section of Pandas documentation for details.

Pandas primarily uses the value `np.nan` to represent missing data. It is by default not included in computations.

In [44]:
# Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
# Add a new column "E" and set the first two rows of "E" to be "1"
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C  D  F    E
2022-03-06  0.000000  0.000000  0.824433  5  1  1.0
2022-03-07 -0.741747 -0.846171 -0.606836  5  2  1.0
2022-03-08  2.444058 -1.958974  0.472534  5  3  NaN
2022-03-09 -0.958433 -0.159032 -1.932648  5  4  NaN

To drop any rows that have missing data:

In [45]:
# Drop rows with any missing (NaN) values
# The 'how="any"' parameter specifies that if any column in a row has a NaN value, that row will be dropped
df1.dropna(how="any")

                   A         B         C  D  F    E
2022-03-06  0.000000  0.000000  0.824433  5  1  1.0
2022-03-07 -0.741747 -0.846171 -0.606836  5  2  1.0

Filling missing data:

In [46]:
# Fill missing (NaN) values in the DataFrame `df1` with the specified value (5)
df1.fillna(value=5)

                   A         B         C  D  F    E
2022-03-06  0.000000  0.000000  0.824433  5  1  1.0
2022-03-07 -0.741747 -0.846171 -0.606836  5  2  1.0
2022-03-08  2.444058 -1.958974  0.472534  5  3  5.0
2022-03-09 -0.958433 -0.159032 -1.932648  5  4  5.0

To get the boolean mask where values are _NaN_:

In [47]:
# Check for missing (NaN) values in the DataFrame 'df1'
# df1.isna() returns a DataFrame of the same shape as 'df1' with True for NaN values and False for non-NaN values

df1.isna()

                A      B      C      D      F      E
2022-03-06  False  False  False  False  False  False
2022-03-07  False  False  False  False  False  False
2022-03-08  False  False  False  False  False   True
2022-03-09  False  False  False  False  False   True

## Operations

See the [Flexible binary operations](https://pandas.pydata.org/docs/user_guide/basics.html#basics-binop) section of Pandas documentation for details.

### Stats

Operations in general exclude missing data.

Performing a descriptive statistic:

In [48]:
df

                   A         B         C  D  F
2022-03-06  0.000000  0.000000  0.824433  5  1
2022-03-07 -0.741747 -0.846171 -0.606836  5  2
2022-03-08  2.444058 -1.958974  0.472534  5  3
2022-03-09 -0.958433 -0.159032 -1.932648  5  4
2022-03-10 -0.206521  0.508824  0.094088  5  5
2022-03-11 -0.751636 -0.548407  0.892564  5  6

In [49]:
df.max(axis=0)  # Get max of all columns

A    2.444058
B    0.508824
C    0.892564
D    5.000000
F    6.000000
dtype: float64

Same operation on the other axis:

In [50]:
df.max(axis=1)  # Get max of all rows

2022-03-06    5.0
2022-03-07    5.0
2022-03-08    5.0
2022-03-09    5.0
2022-03-10    5.0
2022-03-11    6.0
Freq: D, dtype: float64

In [51]:
# Create a pandas DataFrame with employee performance metrics for three departments
# The DataFrame includes some missing values (NaN) to demonstrate handling of incomplete data
data = {
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],
    'Sales': [12000, 15000, None, 10000, 18000, 13000],
    'Productivity': [85, 90, 78, 82, 95, None],
    'Customer_Rating': [4.5, None, 4.0, 3.8, 4.8, 4.2]
}
df_emp = pd.DataFrame(data)

In [52]:
# Display the full DataFrame to view its contents
print("Full DataFrame:")
print(df_emp)

Full DataFrame:
  Employee    Sales  Productivity  Customer_Rating
0    Alice  12000.0          85.0              4.5
1      Bob  15000.0          90.0              NaN
2  Charlie      NaN          78.0              4.0
3    David  10000.0          82.0              3.8
4      Eve  18000.0          95.0              4.8
5    Frank  13000.0           NaN              4.2

In [53]:
# Compute descriptive statistics for all numerical columns using describe()
# This provides count, mean, std, min, 25% (Q1), 50% (median), 75% (Q3), and max
print("\nDescriptive Statistics (describe()):")
print(df_emp.describe())

Descriptive Statistics (describe()):
              Sales  Productivity  Customer_Rating
count      5.000000      5.000000         5.000000
mean   13600.000000     86.000000         4.260000
std     3049.590136      6.670832         0.397492
min    10000.000000     78.000000         3.800000
25%    12000.000000     82.000000         4.000000
50%    13000.000000     85.000000         4.200000
75%    15000.000000     90.000000         4.500000
max    18000.000000     95.000000         4.800000

In [54]:
# Compute specific quantiles (10th, 25th, 75th, 90th percentiles) for each numerical column
# quantile() accepts a single value or list of values between 0 and 1
print("\nCustom Quantiles (10th, 25th, 75th, 90th percentiles):")
print(df_emp[['Sales', 'Productivity', 'Customer_Rating']].quantile([0.1, 0.25, 0.75, 0.9]))

Custom Quantiles (10th, 25th, 75th, 90th percentiles):
        Sales  Productivity  Customer_Rating
0.10  10800.0          79.6             3.88
0.25  12000.0          82.0             4.00
0.75  15000.0          90.0             4.50
0.90  16800.0          93.0             4.68

In [55]:
# Compute the mean for each metric
print("\nMean Values per Metric:")
print(df_emp[['Sales', 'Productivity', 'Customer_Rating']].mean())

Mean Values per Metric:
Sales              13600.00
Productivity          86.00
Customer_Rating        4.26
dtype: float64

In [56]:
# Compute the median (50th percentile) for each metric
print("\nMedian Values per Metric:")
print(df_emp[['Sales', 'Productivity', 'Customer_Rating']].median())

Median Values per Metric:
Sales              13000.0
Productivity          85.0
Customer_Rating        4.2
dtype: float64

In [57]:
# Compute the standard deviation for each metric
print("\nStandard Deviation per Metric:")
print(df_emp[['Sales', 'Productivity', 'Customer_Rating']].std())

Standard Deviation per Metric:
Sales              3049.590136
Productivity          6.670832
Customer_Rating       0.397492
dtype: float64

In [58]:
# Count non-missing values for each metric
print("\nCount of Non-Missing Values per Metric:")
print(df_emp[['Sales', 'Productivity', 'Customer_Rating']].count())

Count of Non-Missing Values per Metric:
Sales              5
Productivity       5
Customer_Rating    5
dtype: int64

In [59]:
# Compute the minimum value across all metrics for each employee
# Use min() along axis=1 to find the lowest value per row (excluding 'Employee' column)
print("\nMinimum Value per Employee (across metrics):")
print(df_emp[['Sales', 'Productivity', 'Customer_Rating']].min(axis=1))

Minimum Value per Employee (across metrics):
0     4.5
1    90.0
2     4.0
3     3.8
4     4.8
5     4.2
dtype: float64

### Apply

Applying functions to the data:

In [60]:
df.apply(lambda x: x.max() - x.min(), axis=1)  # Get the max-min differences of columns
# def test(x):
#   result = x.max() - x.min()
#   return result

2022-03-06    5.000000
2022-03-07    5.846171
2022-03-08    6.958974
2022-03-09    6.932648
2022-03-10    5.206521
2022-03-11    6.751636
Freq: D, dtype: float64

### String Methods

Series is equipped with a set of string processing methods in the `str` attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in `str` generally uses regular expressions by default (and in some cases always uses them).

In [61]:
# Create a pandas Series with a mix of strings and a NaN value
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])

# Apply the `str.lower()` function to convert all string elements in the Series to lowercase
# This function works element-wise, meaning it will convert each string in the Series to lowercase
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [62]:
# Create a pandas DataFrame with data about animal species
# Columns include species name, weight, lifespan, population size, and predation risk
data = {
    'species': ['Tiger', 'Elephant', 'Blue Whale', 'Bald Eagle'],
    'weight_kg': [250, 5000, 150000, 6],
    'lifespan_years': [15, 60, 90, 20],
    'population': [3900, 40000, 25000, 100000],
    'predation_risk': [0.3, 0.1, 0.05, 0.2]
}
animal_data = pd.DataFrame(data)

In [63]:
# Display the full DataFrame to view its contents
print("Full DataFrame:")
print(animal_data)

Full DataFrame:
      species  weight_kg  lifespan_years  population  predation_risk
0       Tiger        250              15        3900            0.30
1    Elephant       5000              60       40000            0.10
2  Blue Whale     150000              90       25000            0.05
3  Bald Eagle          6              20      100000            0.20

In [64]:
# Filter the `animal_data` DataFrame to include animals with a weight greater than 1000 kg
# The condition animal_data["weight_kg"] > 1000 selects rows where the weight exceeds 1000 kg
# Then, select only the columns whose names start with "p"
# This is achieved using the str.startswith("p") function on the column names
filtered_data = animal_data[animal_data["weight_kg"] > 1000][
    animal_data.columns[pd.Series(animal_data.columns).str.startswith("p")]
]

In [65]:
# Display the filtered DataFrame
print("\nFiltered DataFrame (weight > 1000 kg, columns starting with 'p'):")
print(filtered_data)

Filtered DataFrame (weight > 1000 kg, columns starting with 'p'):
   population  predation_risk
1       40000            0.10
2       25000            0.05

## Getting data in/out

### CSV

Writing to a csv file:

In [66]:
# Save the DataFrame `df` to a CSV file named "foo.csv"
# The `to_csv` method writes the data from the DataFrame into a CSV file
df.to_csv("foo.csv")

Reading from a csv file:

In [67]:
# Use pandas to read a CSV file and load its contents into a DataFrame
df = pd.read_csv("foo.csv")
df

   Unnamed: 0         A         B         C  D  F
0  2022-03-06  0.000000  0.000000  0.824433  5  1
1  2022-03-07 -0.741747 -0.846171 -0.606836  5  2
2  2022-03-08  2.444058 -1.958974  0.472534  5  3
3  2022-03-09 -0.958433 -0.159032 -1.932648  5  4
4  2022-03-10 -0.206521  0.508824  0.094088  5  5
5  2022-03-11 -0.751636 -0.548407  0.892564  5  6

### HDF5

HDF5 is a unique technology suite that makes possible the management of extremely large and complex data collections. If you want to know more about HDF5 format, please see [Introduction to HDF5](https://support.hdfgroup.org/documentation/hdf5/latest/_intro_h_d_f5.html) for details.

Reading and writing to HDFStores.

In [68]:
# Save the DataFrame 'df' to a HDF5 file named 'foo.h5', with the data stored under the key "df"
df.to_hdf("foo.h5", key="df")

Reading from a HDF5 Store:

In [69]:
# Use pandas to read an HDF5 file ("foo.h5") and load the data from the "df" dataset
df = pd.read_hdf("foo.h5", "df")
df

   Unnamed: 0         A         B         C  D  F
0  2022-03-06  0.000000  0.000000  0.824433  5  1
1  2022-03-07 -0.741747 -0.846171 -0.606836  5  2
2  2022-03-08  2.444058 -1.958974  0.472534  5  3
3  2022-03-09 -0.958433 -0.159032 -1.932648  5  4
4  2022-03-10 -0.206521  0.508824  0.094088  5  5
5  2022-03-11 -0.751636 -0.548407  0.892564  5  6

In [70]:
# Replace specific cells with NaN using loc
df.loc[1, 'A'] = np.nan  # Row index 1, PageRank column
df.loc[2, 'D'] = np.nan    # Row index 2, Degree column
df

   Unnamed: 0         A         B         C    D  F
0  2022-03-06  0.000000  0.000000  0.824433  5.0  1
1  2022-03-07       NaN -0.846171 -0.606836  5.0  2
2  2022-03-08  2.444058 -1.958974  0.472534  NaN  3
3  2022-03-09 -0.958433 -0.159032 -1.932648  5.0  4
4  2022-03-10 -0.206521  0.508824  0.094088  5.0  5
5  2022-03-11 -0.751636 -0.548407  0.892564  5.0  6

### Excel

Reading and writing to MS Excel.

Writing to an excel file:

In [71]:
# Save the dataframe 'df' to an Excel file with the name 'foo.xlsx'
# The data will be written to the sheet named 'Sheet1'
df.to_excel("foo.xlsx", sheet_name="Sheet1")

Reading from an excel file:

In [72]:
# Read an Excel file and load the data from "Sheet1"
# - "foo.xlsx" is the path to the Excel file.
# - "Sheet1" specifies the sheet name to be read.
# - index_col=None ensures that no column is used as the index.
# - na_values=["NA"] specifies that any "NA" values in the data should be treated as NaN (Not a Number).
df = pd.read_excel("foo.xlsx", "Sheet1", index_col=None, na_values=["NA"])
new_columns = ['id', 'date'] + df.columns[2:].tolist()
df.columns = new_columns
df

   id        date         A         B         C    D  F
0   0  2022-03-06  0.000000  0.000000  0.824433  5.0  1
1   1  2022-03-07       NaN -0.846171 -0.606836  5.0  2
2   2  2022-03-08  2.444058 -1.958974  0.472534  NaN  3
3   3  2022-03-09 -0.958433 -0.159032 -1.932648  5.0  4
4   4  2022-03-10 -0.206521  0.508824  0.094088  5.0  5
5   5  2022-03-11 -0.751636 -0.548407  0.892564  5.0  6

## Conclusion

In this module, we've learned about understanding Pandas data structures: Series and DataFrame. We also learned to create, read, and manipulate DataFrames, performed basic data analysis operations using Pandas, and handled missing data in Pandas.

## Clean up

Remember to shut down your Jupyter Notebook instance when you're done to avoid unnecessary charges. You can do this by stopping the notebook instance from the Amazon SageMaker console.